[
  {
    "url": "https://marcl.github.io/see-it-off/",
    "data": {
      "title": "See It Off",
      "subtitle": "2017",
      "description": "This was a fun web game which I made with my work colleague [Cyrièle Piancastelli](http://cyro.me/) to celebrate/commiserate the depature of our team mate [Tom Robinson](https://twitter.com/iamtmrobinson) earlier in 2017. I used the [Phaser](http://phaser.io/) JavaScript framework for the first time and this made it really easy to get a fun game up and running quickly. You can find [the code here](https://github.com/MarcL/see-it-off) but be warned that it was written very quickly over a few nights so don't view it as best practice for games programming!",
      "gameImage": "/images/games/see-it-off-javascript-web-game.jpg",
      "icons": ["globe", "laptop", "desktop", "mobile"]
    }
  },
  {
    "data": {
      "title": "What The Book",
      "subtitle": "2015",
      "description": "This was a mobile puzzle game I originallly started before [I became very ill](/how-i-almost-died/) but it took me a year and a half to finish in the end. This was written using C# and the [Unity](https://unity3d.com/) game engine. This was a great project for learning about integration of in-app payments, social network sharing and advertising networks. Unfortunately, I ended up taking the project down due to copyright claims because I was using books as the main theme for the puzzles.",
      "gameImage": "/images/games/what-the-book-ios-game.jpg",
      "icons": ["apple", "mobile"]
    }
  },
  {
    "data": {
      "title": "Santa's Chrismas Present Countdown",
      "subtitle": "2014",
      "description": "This was a simple one-touch game I wrote using C# and the [Unity](https://unity3d.com/) game engine. Different coloured presents fall from the top of the screen at increasing speeds and the player scores points by catching them with the correctly coloured Santa. A very basic game but taught me about Unity and adding advertising networks, and automating deployment to the Apple app store.",
      "gameImage": "/images/games/santas-christmas-present-countdown-ios-game.jpg",
      "icons": ["apple", "mobile"]
    }
  },
  {
    "data": {
      "title": "2K Drive",
      "subtitle": "2013",
      "description": "I was responsible for a lot of the backend server code for this driving game from [Lucid](http://www.lucidgames.co.uk/). Written in PHP, it allowed on-the-fly updates of new game modes and easy update of the game's economy and statistics for game balancing. It taught me an awful lot about effective caching, devops and how not to write solid unit and integration tests for a project. I've learnt an awful lot about properly mocking and stubbing systems since this game!",
      "gameImage": "/images/games/2k-drive-568x568.jpg",
      "icons": ["apple", "android", "mobile", "tablet"]  
    }
  },
  {
    "data": {
      "title": "The Walking Dead: Assault",
      "subtitle": "2012",
      "description": "One of my first mobile titles which was based on The Walking Dead graphic novels rather than the TV series of the same name. I built the game editor, some of the game modes and the inventory sytems for this fun real-time strategy game on iOS and Android.",
      "gameImage": "/images/games/walking-dead-assault-568x568.jpg",
      "icons": ["apple", "android", "mobile", "tablet"]
    }
  },
  {
    "data": {
      "title": "Shift 2: Unleashed",
      "subtitle": "2011",
      "description": "After many years of being a Sony developer, contracting for [Slightly Mad Studios](http://www.slightlymadstudios.com/) allowed me to work on a cross-platform game, developing for the XBox 360, PS3 and PC. I developed the in-game downloadable content systems and EA's Online Pass for this game across all platforms.",
      "gameImage": "/images/games/shift2-unleashed-640x360.jpg",
      "icons": ["gamepad"]
    }
  },
  {
    "data": {
      "title": "WipEout Pulse",
      "subtitle": "2007",
      "description": "My first lead programmer role was developing the sequel to the successful PSP version of WipEout called WipEout Pure. Although a did a lot of bug fixing and implemented some low-level game saving, my job was mainly managing a team of 11 programmers and attempting to help to get the game out on time, within the memory constraints.",
      "gameImage": "/images/games/wipeout-pulse-480x272.jpg",
      "icons": ["gamepad"]
    }
  },
  {
    "data": {
      "title": "F1 2006 / F1 Championship Edition",
      "subtitle": "2006",
      "description": "Another classic Sony developed franchise from the late 90s until the final PS3 version in 2007. I helped to get the game running on PSP and mainly managed and mentored a team of graduate programmers in implementing the game's user interface across the PSP, PS2 and PS3 versions of the game.",
      "gameImage": "/images/games/f1-championship-edition-640x360.jpg",
      "icons": ["gamepad"]
    }
  },
  {
    "data": {
      "title": "WipEout Pure",
      "subtitle": "2005",
      "description": "Joining Sony's sadly-no-longer-with-us [Liverpool Studio](http://www.worldwidestudios.net/) back in 2004, allowed me to work on the first PSP title for the studio - WipEout Pure. A handheld version of the classic futuristic racing game which showed off the new console's power. I worked on some of the UI but mainly implemented the game's audio and video streaming systems. This project was one of the most fun I've worked on. A great team and a fantastic atmosphere.",
      "gameImage": "/images/games/wipeout-pure-480x272.jpg",
      "icons": ["gamepad"]
    }
  },
  {
    "data": {
      "title": "Wolverine's Revenge",
      "subtitle": "2003",
      "description": "Marvel and Activision's Wolverine Revenge was developed at another now-defunct studio in the North West of England called Genepool Software. I was brought on board to write the game's streaming audio system on PS2 and develop many of the game's boss battle AI. A difficult project to work on due to the game's somewhat brittle game engine, but the game ended up being quite fun in the end.",
      "gameImage": "/images/games/wolverines-revenge-512x384.jpg",
      "icons": ["gamepad"]
    }
  },
  {
    "data": {
      "title": "Silver",
      "subtitle": "1998",
      "description": "Silver was a classic RPG in the vein of the Japanese role playing games of the mid-90s. Think Final Fantasy but with British accents! This was one of the hardest but most fun projects that I worked on. Many, many late nights helped to get this game out of the door but expanding on an in-game scripting language, developing lots of the enemy and boss AI and helping to design and script up game levels made it brilliant fun.",
      "gameImage": "/images/games/silver-640x480.jpg",
      "icons": ["desktop"]
    }
  }
]
